{
  "businessData": [
    {
      "id": "lag",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/leaderag-logo.png",
      "title": "Leader AG",
      "imgAlt": "Leader AG Logo",
      "slog": "Leading Company among the Group.",
      "detail": "Leader AG was launched with the constant effort of few hard working persons, supervised by the visionary directors of the company who brought the business volume amazingly expanded in 2007. Within a short period of seven years, the business got extended to the mark able volume. Leader AG is working for the better filed of farmers through providing quality products on competitive rates. We have highly technical professional & business oriented marketing team. We are focusing on agriculture trends & on personalized customer services to full fill day to day market needs. We deal with the quality of chemicals, fertilizer & seed which provide high yield. Leader AG's technically trained sales team is providing field services to the farmers and conducting farmer meetings to communicate new technology, in time recommendations and solution for their problems & guiding them at every stage of crop."
    },
    {
      "here rsjcisjd sj
    {
      "id": "p4l",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/plant4life-logo.png",
      "title": "Plant4Life (Pvt.) Ltd.",
      "imgAlt": "Plant4Life Logo",
      "slog": "New Emerging Farmer Focused Business Company.",
      "detail": "Plant4Life (Pvt.) Ltd. is a newly formed company that has been setup by a group of professionals having decades of experience in agriculture related businesses in Pakistan. The team has a wide array of expertise in marketing, selling and distribution of plant protection products, plant nutrients and seeds. Plant4Life (Pvt.) Ltd. has been incorporated as a Private Limited company in Pakistan and has been adequately capitalized. The company is poised for marketing and distribution roll-out in a phased manner in all the four provinces of Pakistan. The mission of Plant4Life is to; Provide innovation yet cost-effective quality solutions to the Pakistani farmer to help/enable them to get better yields. To introduce new technologies in the areas of plant protection, plant nutrition and Seeds. Build a company that fosters creativity and embraces positive change for customer delight, employee development, shareholder benefit and social benefit."
    },
    {
      "id": "agn",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/agrinar-logo.png",
      "imgAlt": "Agrinar Pakistan Logo",
      "title": "Agrinar Pakistan",
      "slog": "Provide Most Compelling Business Opportunities.",
      "detail": "Agrinar Pakistan is the 4th business entity and latest launch of Yaqoob Group of Companies. Agrinar offers a complete Agrochemical portfolio, supplemented with high quality seeds. We always believe, to be a prosperous company in the future, the quality assurance, immediate service (supplies & availability) and reliable philosophy together with competitive prices. The Company is fully backed by comprehensive analytical facilities and quality management procedures. Most importantly Agrinar is a passionate, energetic, aggressive  diverse team. After completing amazingly a successful launch in all important pockets of Punjab our recent intention is pragmatic entry in KPK, Sindh and Balochistan."
    },
    {
      "id": "fs",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/fairseed-logo.png",
      "title": "Fair Seed",
      "imgAlt": "Fair Seed Logo",
      "slog": " New Pillar to Provide High Quality Seeds.",
      "detail": "Seed is the most decisive input in agriculture. The Fair seeds is focusing on providing genetically premium quality seed to the farming community of Pakistan. The Company has vast experience in seed production of major agricultural crops backed by a very strong in-house R&D programme for crops maize, cotton, Wheat, Mustard, sun flower, bajra, sorghum, rice, and several vegetable crops. The FairSeed has a dedicated team of researchers and  we are conscious of the changing needs of farmers and consumers to design and develop productive hybrids and conventional breeding that excel in the market and fetch rewarding returns. We are providing the smart production technology of the crops in all over Pakistan and helping to increase the per Acre yield."
    },
    {
      "id": "sah",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/sahaab-logo.png",
      "title": "Sahaab Enterprises",
      "imgAlt": "Sahaab Enterprises Logo",
      "slog": " Eventual Entity for Competitive Marketing Edge.",
      "detail": "Sahaab Enterprises is a division of Yaqoob Sons and was founded to address the agricultural market needs of Sindh and Balochistan. Here at Sahaab Enterprises, we continue the legacy of the Yaqoob Groups in providing high quality products. The company was founded on the idea that maintaining satisfied customers is essential to the financial health of the organization and with this in mind, the organization works hard to ensure that all customers’ expectations are exceeded in all transactions The company is an agri-business entity which focuses on the big retailers and the distributors With a smaller but efficient workforce, we are able to provide the most competent prices to our customers. As a result, our net sales volume per capita is the highest compared to the competition. We believe in sustainable growth and are exploring new solutions and varieties for plant-based nutrition. Our aim is to fulfil the ever-increasing regional demand of agro-products and assist the agricultural growth of the land. Ultimately, we wish to play a key role in the prosperity of the region and the nation as a whole."
    },
    {
      "id": "ys",
      "logoUrl": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/logos/yaqoobsons-logo.png",
      "title": "Yaqoob Sons",
      "imgAlt": "Yaqoob Sons Logo",
      "slog": "Sole Distribution Outlet.",
      "detail": "Our story dates back to 30 years, a small but promising startup sprung in Vehari which was to make a mark on agriculture business nationally in the years to come The entrepreneurship of Rao Muhammad Afzal and Muhammad Shahid Azeem was soon to prove that this little startup was going to pave way for one of the biggest retailers of Pakistan and end up having numerous successful outlets spread at different market place. The reason behind the success of Yaqoob Sons was its undaunting ideology. Over the decades, Yaqoob Sons have maintained its hallmark of providing premium and cost-effective products to the growers. Through the exemplary leadership and unprecedented hard work of its employees; Yaqoob Sons, along with numerous other sister companies, falls under a successful bigger corporate association – The Yaqoob Group. Today, we are proud to be a key player in Pakistan’s national agricultural marketplace. We will continue to provide superior quality products and services to our consumers. We aspire to excel in our product quality and services to our growers and associates"
    }
  ],
  "managementData": [
    {
      "id": "afzal",
      "img": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/images/mg/afzal.png",
      "name": "Mr. Rao Muhammad Afzal",
      "designation": "Group President",
      "quote": "Each on of us can make a Difference. Together we make Change.",
      "full": "Mr. Rao Muhammad Afzal is an ambitious, dedicated, and accomplished businessman. He is a man of his principles with the utmost regard for work-ethics. His expertise in human asset-management and business strategy makes him an essential part of the business. He is a firm advocate of just and equitable trade. His upright, outspoken and trustworthy personality allows him to collaborate with numerous businesses, both on the national and international levels. His firm belief in distinctiveness, diversity, and innovation has led the business to acme. Mr. Rao Muhammad Afzal is highly capable of identifying potential business opportunities. With his unprecedented expertise, he makes use of such opportunities and yields maximum results. He is an enthusiastic individual. He ensures that high level of communication is maintained in his team. He is always aware of the circumstances, even at the grass-root level of the organisation. His basic attribute of never turning blind eye to the needs of his team, enable him to create a prevailing sense of family among the workforce. He sets the standards high for people in the marketplace holding the same office like his."
    },
    {
      "id": "shahid",
      "img": "https://raw.githubusercontent.com/ahsanghalib/ygwebassets/master/images/mg/shahid.png",
      "name": "Mr. Muhammad Shahid Azeem",
      "designation": "Group Director",
      "quote": "The greatest leader is not necessarily the one who does the greatest things. He is the one that gets the people to do the greatest things.",
      "full": "Mr. Shahid Azeem has a competent and passionate personality. His dynamic, energetic, and firm personality is acknowledged among both, his peers and competitors. He believes in the idea of persistent hard work. He never hesitates to put himself through new challenges. Mr. Shahid Azeem displays, through his commendable behaviour, the epitome of leadership skills. He exhibits tranquillity and composure in hard times and under pressure; this is the key to his success as a team leader. As he says, \"One who breaks under pressure would never succeed.\" He believes that pressure and challenges bring great opportunities and those who endure the pain get the maximum gains. His untiring, relentless and consistent approach towards perfection is the reason behind his thriving business."
    }
  ],
  "valuesData": [
    {
      "title": "Quality",
      "desc": "Delivering excellent standards consistently"
    },
    {
      "title": "Value",
      "desc": "Delivering exceptional value to customers"
    },
    {
      "title": "Innovation",
      "desc": "Need to continue to be at the forefront of innovation in both general merchandising and food"
    },
    {
      "title": "Trust",
      "desc": "As the most trusted Group we have a proud heritage of staff welfare, customer care and involvement in the community"
    },
    {
      "title": "Service",
      "desc": "They are committed to deliver the best services to customers"
    },
    {
      "title": "Valued",
      "desc": "Employees contribution to the business is rewarded"
    },
    {
      "title": "Fairly treated",
      "desc": "Employees are respected and values, whoever they are."
    },
    {
      "title": "Committed",
      "desc": "To delivering great customer service"
    },
    {
      "title": "Involved",
      "desc": "Employees are informed of new developments and kept up-to-date with the progress of the company."
    },
    {
      "title": "Challenged",
      "desc": "Employees challenge each other constructively every day and work at full potential"
    }
  ],
  "historyData": {
    "title": "HISTORY",
    "data": "The phenomenal growth of Yaqoob Group in a short span of 20 years is envy of many. Yaqoob Group with its qualified staff of professionals has acquired and reflects the expertise and professionalism. Our team of professionals possesses expertise and vision in different aspects of Pakistan Market, allowing the organization to market a board range of products for the development of Agro Sector. The group initiated formation of its activities with the vast exposure of its management team & a humble beginning by setting Yaqoob Group in 1994. Yaqoob Group is one of fast growing, most respected and well reputed business group in agriculture sector. We are dealing in marketing of Agro based products in different areas of Pakistan. Across the group customer service is the top priority. The business strives to provide the highest quality of service in all areas."
  }
}
